# ParameterDownloadOptions Properties

---
The ParameterDownloadOptions type exposes the following members.
| Name| Description
---|---|---
| IsInstance|  True if binding to Element instances, false if binding to Element types.
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| Visible|  True if the parameter is visible to the user, false if it is hidden and accessible only via the API.
Top
#### Reference
ParameterDownloadOptions Class
Autodesk.Revit.DB Namespace